
class Contents{

  static final List<String> covers =[
    'book_cover_0.jpg',
    'book_cover_1.jpg',
    'book_cover_2.jpg',
    'book_cover_3.jpg',
    'book_cover_4.jpg',
    'book_cover_5.jpeg',
    'book_cover_6.jpeg',
    'book_cover_7.jpg',
    'book_cover_8.jpeg',
    'book_cover_9.jpg',
    'book_cover_10.jpg',
  ];

  static final List<double> rating = [3,2,5,4,2,3,5,3,2,3,3,4];
  static final List<double> topRating = [4,3,5,4,2,3,5,4,5];


  static final List<String> topCovers =[
    'book_cover_top_1.jpg',
    'book_cover_top_2.jpg',
    'book_cover_top_3.jpg',
    'book_cover_top_4.jpg',
    'book_cover_top_5.jpg',
    'book_cover_top_6.jpg',
    'book_cover_top_7.jpg',
  ];

  static final List<String> names =[
    'سارا',
    'مرتضی',
    'مهشید',
    'افسانه',
    'سحر',
    'فاطمه',
    'فرهاد',
    'نسترن',
    'سعید',
    'امینم',
    'توپاک',
  ];

  static final List<String> bookNames =[
    'کتاب قرمز',
    'بهترین سالها',
    'روباه',
    'مقررات',
    'معجزه آب',
    'مقررات یک مرد سیاه',
    'پرفکت اسکوپ',
    'زنجبیل',
    'بازدم',
    'فضا',
    'انتظار خانوم ها',
  ];

  static final List<String> topBookNames =[
    'بین طبیعت و ذهن',
    'مصر',
    'آنچه ما به حرکت در می آوریم',
    'پروانه سیلیکونی',
    'گوش دادن به میوزیک',
    'شرکت خلاقیت',
    'درباره امریکا',
  ];

  static final List<String> category =[
    'روانشاسی',
    'تاریخ',
    'عمومی',
    'تکنولوژی',
    'موسیقی',
    'خلاقیت',
    'سیاسی',
  ];
  static final String description = "این اولین کتاب به زبان انگلیسی است که به طور کامل به فلسفه ی علوم اجتماعی در سنت قاره ای اختصاص داده شده است. کتاب حاضر به دنبال نشان دادن ماهیت منحصربه فرد رویکرد قاره ای به فلسفه ی علوم اجتماعی است و سنت قاره ای را در تقابل با سنت انگلیسی ـ امریکایی قرار می دهد. این کتاب به سنت های هرمنوتیک، تبارشناسی و نظریه ی انتقادی اختصاص دارد و متون و آراء نظریه پردازان کلیدی این حوزه ازجمله گادامر، ریکور، دریدا، نیچه، فوکو، مکتب فرانکفورت اولیه و هابرماس را بررسی می کند. رویکرد بدیع نویسنده با دنبال کردن ریشه های فکری آراء متفکران برجسته ی قرن بیستم تا یونان و روم باستان، مسیحیت قرون وسطی، روشنگری و رمانتیسم، عمق تاریخی آن ها را نشان می دهد. نویسنده در طول این اثر بر اهمیت فهم تاریخی انگشت می گذارد تا به این وسیله خصلت متمایز و اومانیستی فلسفه ی علوم اجتماعی قاره ای را نشان دهد. ایون شرت عضو هیئت علمی پژوهشی دپارتمان فلسفه ی دانشگاه آکسفورد است. او در دانشگاه های کمبریج، ادینبورو، و ولز تدریس کرده و مؤلف کتاب دیالکتیک مثبت آدورنو است.";


}